namespace Игра_Шмидт_Бойко
{
    internal class Program
    {
        static void Main(string[] args)
        {
            byte HP;
            byte power;
            byte pos_x = 14;
            byte pos_y = 14;
            Console.Title = "Меч короля Артура";
            Console.WriteLine("Добро пожаловать в игру: Меч короля Артура");
            Console.ReadKey();
            Console.Clear();
            Console.WriteLine("Введите своё имя:");
            string playername = Console.ReadLine();
            Console.Clear();
            Console.WriteLine("Выберите свою расу:");
            Console.WriteLine("1.Орк    2.Человек    3.Эльф ");
            byte rasa = Convert.ToByte(Console.ReadLine());
            switch (rasa)
            {
                case 1:
                    Console.Clear();
                    HP = 40;
                    power = 3;
                    Console.WriteLine("Вы Орк " + playername + "!" + "\nВаши характеристики:\nЗдоровье 35\nСила 2");
                    Console.ReadKey();
                    Console.Clear();
                    Console.WriteLine("Нууу, за такое красивое имя мы решили добавить вам ещё 5 здоровья и 1 силу");
                    Console.ReadKey();
                    Console.Clear();
                    Console.WriteLine("Вы Орк " + playername + "!" + "\nВаши характеристики:\nЗдоровье 40\nСила 3");
                    break;
                case 2:
                    Console.Clear();
                    HP = 30;
                    power = 5;
                    Console.WriteLine("Вы Человек " + playername + "!" + "\nВаши характеристики:\nЗдоровье 25\nСила 4");
                    Console.ReadKey();
                    Console.Clear();
                    Console.WriteLine("Нууу, за такое красивое имя мы решили добавить вам ещё 5 здоровья и 1 силу");
                    Console.ReadKey();
                    Console.Clear();
                    Console.WriteLine("Вы Человек " + playername + "!" + "\nВаши характеристики:\nЗдоровье 30\nСила 5");
                    break;
                case 3:
                    Console.Clear();
                    HP = 20;
                    power = 7;
                    Console.WriteLine("Вы Эльф " + playername + "!" + "\nВаши характеристики:\nЗдоровье 15\nСила 6");
                    Console.ReadKey();
                    Console.Clear();
                    Console.WriteLine("Нууу, за такое красивое имя мы решили добавить вам ещё 5 здоровья и 1 силу");
                    Console.ReadKey();
                    Console.Clear();
                    Console.WriteLine("Вы Эльф " + playername + "!" + "\nВаши характеристики:\nЗдоровье 20\nСила 6");
                    break;
            }
            Console.ReadKey();
            Console.Clear();
            for (byte i = 0; i < 12; i++)
            {
                for (byte j = 0; j < 25; j++)
                {
                    Console.Write("%");
                }
             Console.WriteLine();
            }
            char hero =  playername[0];
            Console.WriteLine("00000000000000000000000000000000000000000000000000 \r\n000000000000000000000__000000000000000000000000000 \r\n0000000000000000000000___0000000000000000000000000 \r\n0000000000000000000000000_____00000000000000000000 \r\n00000000000000000000000000000_____0000000000000000 \r\n00000000000000000000000000000000_____0000000000000 \r\n0000000000000000000000000000000000_____00000000000 \r\n00000000000000__________000000000000_____000000000 \r\n000000000000___________000000000000000_____0000000 \r\n0000000000___________0000000000000000000____000000 \r\n000000000__________0000000000000000000000_____0000 \r\n0000000___________000000000000000000000000_____000 \r\n00000___________00__00000000000000000000000_____00 \r\n0000___________0_____00000000000000000000000_____0 \r\n000000_______0000______0000000000000000000000____0 \r\n0000000____00000000______00000000000000000000_____ \r\n000000000000000000000______000000000000000000_____ \r\n0000000000000000000000______00000000000000000_____ \r\n00000000000000000000000000______0000000000000_____ \r\n000000000000000000000000000_______00000000000_____ \r\n00000000000000000000000000000______000000000_____0 \r\n0000000000000000000000000000000______000000______0 \r\n000000000000000000__0000000000000______000______00 \r\n0000000000000000______000000000000_____________000 \r\n000000000000000_________000000000000__00______0000 \r\n0000000000000_____0_________00000000________000000 \r\n00000000000____000000_____________________00_00000 \r\n00000000______0000000000________________0_______00 \r\n0000000______00000000000000000____00000000______00 \r\n0000000_____00000000000000000000000000000000___000 \r\n00000000000000000000000000000000000000000000000000 \r\n00000000000000000000000000000000000000000000000000");
        }
    }
}